MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/uart/implementation_2/hal_ll_uart.c
/****************************************************************************
**
** Copyright (C) ${COPYRIGHT_YEAR} MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The MikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** OF MERCHANTABILITY, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED
** TO THE WARRANTIES FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
** DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT
** OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
** OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
**
****************************************************************************/
/*!
 * @file  hal_ll_uart.c
 * @brief UART HAL LOW LEVEL layer implementation.
 */

#include "hal_ll_rcc.h"
#include "hal_ll_uart.h"
#include "hal_ll_gpio.h"
#include "hal_ll_core.h"
#include "hal_ll_core_defines.h"
#include "hal_ll_uart_pin_map.h"

/*!< @brief Local handle list */
static volatile hal_ll_uart_handle_register_t hal_ll_module_state[UART_MODULE_COUNT] = { (handle_t *)NULL, (handle_t *)NULL, false };

// ------------------------------------------------------------- PRIVATE MACROS
/*!< @brief Helper macro for getting hal_ll_module_state address */
#define hal_ll_uart_get_module_state_address ((hal_ll_uart_handle_register_t *)*handle)
/*!< @brief Helper macro for getting module specific control register structure base address // first register address */
#define hal_ll_uart_get_handle (hal_ll_uart_handle_register_t *)hal_ll_uart_get_module_state_address->hal_ll_uart_handle
/*!< @brief Helper macro for getting module specific control register structure */
#define hal_ll_uart_get_base_struct(_handle) ((hal_ll_uart_base_handle_t *)_handle)
/*!< @brief Helper macro for getting module specific base address directly from HAL layer handle */
#define hal_ll_uart_get_base_from_hal_handle ((hal_ll_uart_hw_specifics_map_t *)((hal_ll_uart_handle_register_t *)\
                                             (((hal_ll_uart_handle_register_t *)(handle))->hal_ll_uart_handle))->hal_ll_uart_handle)->base

/*!< @brief Macros used for calculating actual baud rate value and error value */
#define HAL_LL_UART_ACCEPTABLE_ERROR (float)1.0
#define hal_ll_uart_get_baud(_clock,_baud,_div) (((_clock/(float)_baud)/_div)-1)
#define hal_ll_uart_get_real_baud(_clock,_baud,_div) (_clock/(_div*(_baud+1)))
#define hal_ll_uart_get_baud_error(_baud_real,_baud) (((float)(abs(_baud_real-_baud))/_baud)*100)

#if defined(STM32F7xx) || defined(STM32H7xx)
#define HAL_LL_USART1EN 4
#elif defined(STM32F3xx) || defined(STM32L4xx) || defined(STM32G0xx) || \
      defined(STM32L0xx) || defined(STM32F0xx)
#define HAL_LL_USART1EN 14
#endif
#define HAL_LL_USART2EN 17
#define HAL_LL_USART3EN 18
#define HAL_LL_UART4EN 19
#define HAL_LL_UART5EN 20
#define HAL_LL_USART6EN 5
#if defined(STM32F7xx) || defined(STM32H7xx)
#define HAL_LL_UART7EN 30
#elif defined(STM32F0xx)
#define HAL_LL_USART7EN 6
#endif
#if defined(STM32F7xx) || defined(STM32H7xx)
#define HAL_LL_UART8EN 31
#elif defined(STM32F0xx)
#define HAL_LL_USART8EN 7
#endif

#if defined(STM32G0xx)
#define HAL_LL_USART1_LOW 0
#define HAL_LL_USART1_HIGH 1
#define HAL_LL_USART2_LOW 2
#define HAL_LL_USART2_HIGH 3

#define HAL_LL_HSI16_CLOCK 16000000UL
#endif

#define HAL_LL_UART_ISR_RXNE 5
#define HAL_LL_UART_ISR_TXE 7
#define HAL_LL_UART_ISR_ICR_ORE 3

#define HAL_LL_UART_CR1_UE 0
#define HAL_LL_UART_CR1_TE 3
#define HAL_LL_UART_CR1_RE 2

/*!< @brief Macros defining register bit values */
#define STOP_BITS_HALF 0x1000U
#define STOP_BITS_ONE 0x0U
#define STOP_BITS_ONE_AND_A_HALF 0x3000U
#define STOP_BITS_TWO 0x2000U

#define DATA_BIT_7 0x10000000UL
#define DATA_BIT_8 0x0U
#define DATA_BIT_9 0x1000U

#define PARITY_ENABLED 0x400U
#define PARITY_NO 0x0U
#define PARITY_EVEN 0x0U
#define PARITY_ODD 0x200U

/*!< @brief Macro used for setting pin alternate functions */
#define HAL_LL_UART_AF_CONFIG (GPIO_CFG_MODE_ALT_FUNCTION | GPIO_CFG_SPEED_HIGH | GPIO_CFG_OTYPE_PP)

/*!< @brief Macros used for interrupts */
#define HAL_LL_UART_IT_MASK 0x1FU
#define HAL_LL_UART_IT_CLEAR_MASK 0x123BFFUL
#define HAL_LL_UART_IT_CR1_MASK 0x1F0UL
#define HAL_LL_UART_IT_CR2_MASK 0x40UL
#define HAL_LL_UART_IT_CR3_MASK 0x401UL

#define HAL_LL_UART_IT_PE 0x28U
#define HAL_LL_UART_IT_TXE 0x727U
#define HAL_LL_UART_IT_TC 0x626U
#define HAL_LL_UART_IT_RXNE 0x525U
#define HAL_LL_UART_IT_IDLE 0x424U
#define HAL_LL_UART_IT_LBD 0x846U
#define HAL_LL_UART_IT_CTS 0x96AU
#define HAL_LL_UART_IT_CM 0x112EU
#define HAL_LL_UART_IT_WUF 0x1476U
#define HAL_LL_UART_IT_ERR 0x60U
#define HAL_LL_UART_IT_ORE 0x300U
#define HAL_LL_UART_IT_NE 0x200U
#define HAL_LL_UART_IT_FE 0x100U
#if defined(STM32L4xx) || defined(STM32H7xx) || defined(STM32G0xx)
#define HAL_LL_UART_IT_RXFNE 0x525U      // Only for STM32L4, STM32H7 and STM32G0 chips
#define HAL_LL_UART_IT_RXFF 0x183FU      // Only for STM32L4, STM32H7 and STM32G0 chips
#define HAL_LL_UART_IT_TXFE 0x173EU      // Only for STM32L4, STM32H7 and STM32G0 chips
#define HAL_LL_UART_IT_RXFT 0x1A7CU      // Only for STM32L4, STM32H7 and STM32G0 chips
#define HAL_LL_UART_IT_TXFT 0x1B77U      // Only for STM32L4, STM32H7 and STM32G0 chips
#endif
#if defined(STM32L4xx) || defined(STM32H7xx)
#define HAL_LL_UART_IT_TXFNF 0x727U      // Only for STM32L4 and STM32H7 chips
#endif
#if defined(STM32H7xx)
#define HAL_LL_UART_IT_RTO 0xB3AU        // Only for STM32H7 chips
#endif

#define HAL_LL_UART_STATUS_RXNE_FLAG ( 1U << 5 )
#define HAL_LL_UART_STATUS_TXE_FLAG ( 1U << 7 )

/*!< @brief Macro used for status register flag check
 * Used in interrupt handlers.
 */
#define hal_ll_uart_get_status_flags(_handle,_flag) (((hal_ll_uart_base_handle_t *)_handle)->isr & _flag)

/*!< @brief Macro used for status register flag clearing
 * Used in interrupt handlers.
 */
#define hal_ll_uart_clear_status_flag(_handle,_flag) (set_reg_bit( &(((hal_ll_uart_base_handle_t *)_handle)->icr), ( _flag & HAL_LL_UART_IT_CLEAR_MASK ) ) )

