MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/uart/implementation_2/hal_ll_uart.c
void hal_ll_uart_irq_disable( handle_t *handle, hal_ll_uart_irq_t irq )
{
    low_level_handle = hal_ll_uart_get_handle;
    hal_ll_uart_hw_specifics_map_local = hal_ll_get_specifics(hal_ll_uart_get_module_state_address);

    hal_ll_uart_base_handle_t *hal_ll_hw_reg = ( hal_ll_uart_base_handle_t *)hal_ll_uart_hw_specifics_map_local->base;

    switch ( irq ) {
        case HAL_LL_UART_IRQ_RX:
            __HAL_LL_UART_DISABLE_IT( hal_ll_hw_reg, HAL_LL_UART_IT_RXNE );
            break;

        case HAL_LL_UART_IRQ_TX:
            __HAL_LL_UART_DISABLE_IT( hal_ll_hw_reg, HAL_LL_UART_IT_TXE );
            break;

        default:
            break;
    }

    // Check if module interrupt flags are set or not
    if ( ( !check_reg_bit( &hal_ll_hw_reg->cr1, HAL_LL_UART_ISR_RXNE ) ) &&
         ( !check_reg_bit( &hal_ll_hw_reg->cr1, HAL_LL_UART_ISR_TXE ) ) )
    {
        switch ( hal_ll_uart_hw_specifics_map_local->module_index )
        {
            #if defined(UART_MODULE_1) && defined(UART1_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_1):
                hal_ll_core_disable_irq( UART1_NVIC );
                break;
            #endif
            #if defined(UART_MODULE_2) && defined(UART2_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_2):
                hal_ll_core_disable_irq( UART2_NVIC );
                break;
            #endif
            #if defined(UART_MODULE_3) && defined(UART3_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_3):
                hal_ll_core_disable_irq( UART3_NVIC );
                break;
            #endif
            #if defined(UART_MODULE_3) && defined(UART_MODULE_4) && defined(UART3_4_LPUART1_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_3):
                hal_ll_core_disable_irq( UART3_4_LPUART1_NVIC );
                break;
            case hal_ll_uart_module_num(UART_MODULE_4):
                hal_ll_core_disable_irq( UART3_4_LPUART1_NVIC );
                break;
            #endif
            #if defined(UART_MODULE_3) && defined(UART_MODULE_4) && defined(UART3_4_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_3):
                hal_ll_core_disable_irq( UART3_4_NVIC );
                break;
            case hal_ll_uart_module_num(UART_MODULE_4):
                hal_ll_core_disable_irq( UART3_4_NVIC );
                break;
            #endif
            #if defined(UART_MODULE_3) && defined(UART_MODULE_4) && defined(UART_MODULE_5) && \
                defined(UART_MODULE_6) && defined(UART3_6_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_3):
                hal_ll_core_disable_irq( UART3_6_NVIC );
                break;
            case hal_ll_uart_module_num(UART_MODULE_4):
                hal_ll_core_disable_irq( UART3_6_NVIC );
                break;
            case hal_ll_uart_module_num(UART_MODULE_5):
                hal_ll_core_disable_irq( UART3_6_NVIC );
                break;
            case hal_ll_uart_module_num(UART_MODULE_6):
                hal_ll_core_disable_irq( UART3_6_NVIC );
                break;
            #endif
            #if defined(UART_MODULE_3) && defined(UART_MODULE_4) && defined(UART_MODULE_5) && \
                defined(UART_MODULE_6) && defined(UART_MODULE_7) && defined(UART_MODULE_8) && \
                defined(UART3_8_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_3):
                hal_ll_core_disable_irq( UART3_8_NVIC );
                break;
            case hal_ll_uart_module_num(UART_MODULE_4):
                hal_ll_core_disable_irq( UART3_8_NVIC );
                break;
            case hal_ll_uart_module_num(UART_MODULE_5):
                hal_ll_core_disable_irq( UART3_8_NVIC );
                break;
            case hal_ll_uart_module_num(UART_MODULE_6):
                hal_ll_core_disable_irq( UART3_8_NVIC );
                break;
            case hal_ll_uart_module_num(UART_MODULE_7):
                hal_ll_core_disable_irq( UART3_8_NVIC );
                break;
            case hal_ll_uart_module_num(UART_MODULE_8):
                hal_ll_core_disable_irq( UART3_8_NVIC );
                break;
            #endif
            #if defined(UART_MODULE_4) && defined(UART4_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_4):
                hal_ll_core_disable_irq( UART4_NVIC );
                break;
            #endif
            #if defined(UART_MODULE_4) && defined(UART_MODULE_5) && defined(UART4_5_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_4):
                hal_ll_core_disable_irq( UART4_5_NVIC );
                break;
            case hal_ll_uart_module_num(UART_MODULE_5):
                hal_ll_core_disable_irq( UART4_5_NVIC );
                break;
            #endif
            #if defined(UART_MODULE_5) && defined(UART5_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_5):
                hal_ll_core_disable_irq( UART5_NVIC );
                break;
            #endif
            #if defined(UART_MODULE_6) && defined(UART6_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_6):
                hal_ll_core_disable_irq( UART6_NVIC );
                break;
            #endif
            #if defined(UART_MODULE_7) && defined(UART7_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_7):
                hal_ll_core_disable_irq( UART7_NVIC );
                break;
            #endif
            #if defined(UART_MODULE_8) && defined(UART8_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_8):
                hal_ll_core_disable_irq( UART8_NVIC );
                break;
            #endif

            /**
             * @brief LPUART interrupt vectors.
             * @note To be added in a future update.
             */
            /*
            #if defined(UART_MODULE_1) && defined(LPUART1_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_1):
                hal_ll_core_disable_irq( LPUART1_NVIC );
                break;
            #endif
            #if defined(UART_MODULE_1) && defined(AES_LPUART1_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_1):
                hal_ll_core_disable_irq( AES_LPUART1_NVIC );
                break;
            #endif
            #if defined(UART_MODULE_1) && defined(RNG_LPUART1_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_1):
                hal_ll_core_disable_irq( RNG_LPUART1_NVIC );
                break;
            #endif
            #if defined(UART_MODULE_1) && defined(AES_RNG_LPUART1_NVIC)
            case hal_ll_uart_module_num(UART_MODULE_1):
                hal_ll_core_disable_irq( AES_RNG_LPUART1_NVIC );
                break;
            #endif
            */

            default:
                break;
        }
    }
}

void hal_ll_uart_write( handle_t *handle, uint8_t wr_data) {
    hal_ll_uart_hw_specifics_map_local = hal_ll_get_specifics(hal_ll_uart_get_module_state_address);
    hal_ll_uart_base_handle_t *hal_ll_hw_reg = ( hal_ll_uart_base_handle_t *)hal_ll_uart_hw_specifics_map_local->base;

