MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/uart/implementation_2/hal_ll_uart.c
    if ( index_counter ) {
        return hal_ll_module_id;
    } else {
        return HAL_LL_PIN_NC;
    }
}

static hal_ll_uart_hw_specifics_map_t *hal_ll_get_specifics( handle_t handle ) {
    uint8_t hal_ll_module_count = sizeof(hal_ll_module_state) / (sizeof(hal_ll_uart_handle_register_t));
    static uint8_t hal_ll_module_error = sizeof(hal_ll_module_state) / (sizeof(hal_ll_uart_handle_register_t));

    while( hal_ll_module_count-- ) {
        if (hal_ll_uart_get_base_from_hal_handle == hal_ll_uart_hw_specifics_map[hal_ll_module_count].base) {
            return &hal_ll_uart_hw_specifics_map[hal_ll_module_count];
        }
    }

    return &hal_ll_uart_hw_specifics_map[hal_ll_module_error];
}

static void hal_ll_uart_set_clock( hal_ll_uart_hw_specifics_map_t *map, bool hal_ll_state ) {
    switch ( map->module_index )
    {
        #ifdef UART_MODULE_1
        case ( hal_ll_uart_module_num(UART_MODULE_1) ):
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB2ENR, HAL_LL_USART1EN )):(clear_reg_bit( _RCC_APB2ENR, HAL_LL_USART1EN ));
            break;
        #endif
        #ifdef UART_MODULE_2
        case ( hal_ll_uart_module_num(UART_MODULE_2) ):
            #if defined(STM32F7xx) || defined(STM32F3xx) || defined(STM32G0xx) || \
            defined(STM32L0xx) || defined(STM32F0xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR, HAL_LL_USART2EN )):(clear_reg_bit( _RCC_APB1ENR, HAL_LL_USART2EN ));
            #elif defined(STM32H7xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1LENR, HAL_LL_USART2EN )):(clear_reg_bit( _RCC_APB1LENR, HAL_LL_USART2EN ));
            #elif defined(STM32L4xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR1, HAL_LL_USART2EN )):(clear_reg_bit( _RCC_APB1ENR1, HAL_LL_USART2EN ));
            #endif
            break;
        #endif
        #ifdef UART_MODULE_3
        case ( hal_ll_uart_module_num(UART_MODULE_3) ):
            #if defined(STM32F7xx) || defined(STM32F3xx) || defined(STM32G0xx) || \
                defined(STM32F0xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR, HAL_LL_USART3EN )):(clear_reg_bit( _RCC_APB1ENR, HAL_LL_USART3EN ));
            #elif defined(STM32H7xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1LENR, HAL_LL_USART3EN )):(clear_reg_bit( _RCC_APB1LENR, HAL_LL_USART3EN ));
            #elif defined(STM32L4xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR1, HAL_LL_USART3EN )):(clear_reg_bit( _RCC_APB1ENR1, HAL_LL_USART3EN ));
            #endif
            break;
        #endif
        #ifdef UART_MODULE_4
        case ( hal_ll_uart_module_num(UART_MODULE_4) ):
            #if defined(STM32F7xx) || defined(STM32F3xx) || defined(STM32G0xx) || \
            defined(STM32L0xx) || defined(STM32F0xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR, HAL_LL_UART4EN )):(clear_reg_bit( _RCC_APB1ENR, HAL_LL_UART4EN ));
            #elif defined(STM32H7xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1LENR, HAL_LL_UART4EN )):(clear_reg_bit( _RCC_APB1LENR, HAL_LL_UART4EN ));
            #elif defined(STM32L4xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR1, HAL_LL_UART4EN )):(clear_reg_bit( _RCC_APB1ENR1, HAL_LL_UART4EN ));
            #endif
            break;
        #endif
        #ifdef UART_MODULE_5
        case ( hal_ll_uart_module_num(UART_MODULE_5) ):
            #if defined(STM32F7xx) || defined(STM32F3xx) || defined(STM32L0xx) || \
            defined(STM32F0xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR, HAL_LL_UART5EN )):(clear_reg_bit( _RCC_APB1ENR, HAL_LL_UART5EN ));
            #elif defined(STM32H7xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1LENR, HAL_LL_UART5EN )):(clear_reg_bit( _RCC_APB1LENR, HAL_LL_UART5EN ));
            #elif defined(STM32L4xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR1, HAL_LL_UART5EN )):(clear_reg_bit( _RCC_APB1ENR1, HAL_LL_UART5EN ));
            #endif
            break;
        #endif
        #ifdef UART_MODULE_6
        case ( hal_ll_uart_module_num(UART_MODULE_6) ):
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB2ENR, HAL_LL_USART6EN )):(clear_reg_bit( _RCC_APB2ENR, HAL_LL_USART6EN ));
            break;
        #endif
        #ifdef UART_MODULE_7
        case ( hal_ll_uart_module_num(UART_MODULE_7) ):
            #if defined(STM32F0xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB2ENR, HAL_LL_USART7EN )):(clear_reg_bit( _RCC_APB2ENR, HAL_LL_USART7EN ));
            #elif defined(STM32F7xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR, HAL_LL_UART7EN )):(clear_reg_bit( _RCC_APB1ENR, HAL_LL_UART7EN ));
            #elif defined(STM32H7xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1LENR, HAL_LL_UART7EN )):(clear_reg_bit( _RCC_APB1LENR, HAL_LL_UART7EN ));
            #endif
            break;
        #endif
        #ifdef UART_MODULE_8
        case ( hal_ll_uart_module_num(UART_MODULE_8) ):
            #if defined(STM32F0xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB2ENR, HAL_LL_USART8EN )):(clear_reg_bit( _RCC_APB2ENR, HAL_LL_USART8EN ));
            #elif defined(STM32F7xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1ENR, HAL_LL_UART8EN )):(clear_reg_bit( _RCC_APB1ENR, HAL_LL_UART8EN ));
            #elif defined(STM32H7xx)
            (hal_ll_state == true)?(set_reg_bit( _RCC_APB1LENR, HAL_LL_UART8EN )):(clear_reg_bit( _RCC_APB1LENR, HAL_LL_UART8EN ));
            #endif
            break;
        #endif

        default:
            break;
    }
}

static void hal_ll_uart_map_pins( uint8_t module_index, hal_ll_uart_pin_id *index_list ) {
    // Map new pins
    hal_ll_uart_hw_specifics_map[module_index].pins.tx_pin.pin_name = hal_ll_uart_tx_map[ index_list[module_index].pin_tx ].pin;
    hal_ll_uart_hw_specifics_map[module_index].pins.rx_pin.pin_name = hal_ll_uart_rx_map[ index_list[module_index].pin_rx ].pin;
    // TX and RX could have different alternate function settings, hence save both AF values
    hal_ll_uart_hw_specifics_map[module_index].pins.tx_pin.pin_af = hal_ll_uart_tx_map[ index_list[module_index].pin_tx ].af;
    hal_ll_uart_hw_specifics_map[module_index].pins.rx_pin.pin_af = hal_ll_uart_rx_map[ index_list[module_index].pin_rx ].af;
}

