MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/uart/implementation_2/hal_ll_uart.c
static void hal_ll_uart_set_transmitter( hal_ll_uart_base_handle_t *hal_ll_hw_reg, hal_ll_uart_state_t pin_state ) {
    switch ( pin_state )
    {
        case HAL_LL_UART_DISABLE:
            clear_reg_bit( &( hal_ll_hw_reg->cr1 ), HAL_LL_UART_CR1_TE );
            break;

        case HAL_LL_UART_ENABLE:
            set_reg_bit( &( hal_ll_hw_reg->cr1 ), HAL_LL_UART_CR1_TE );
            break;

        default:
            break;
    }
}

static void hal_ll_uart_set_receiver( hal_ll_uart_base_handle_t *hal_ll_hw_reg, hal_ll_uart_state_t pin_state ) {
    switch ( pin_state )
    {
        case HAL_LL_UART_DISABLE:
            clear_reg_bit( &( hal_ll_hw_reg->cr1 ), HAL_LL_UART_CR1_RE );
            break;

        case HAL_LL_UART_ENABLE:
            set_reg_bit( &( hal_ll_hw_reg->cr1 ), HAL_LL_UART_CR1_RE );
            break;

        default:
            break;
    }
}

static void hal_ll_uart_clear_regs( hal_ll_uart_base_handle_t *hal_ll_hw_reg ) {
    /**
     * @note According to reference manual, in order
     * to change control registers, UART module must first
     * be disabled before any other writes.
     */
    hal_ll_uart_set_module( hal_ll_hw_reg, HAL_LL_UART_DISABLE );
    hal_ll_hw_reg->cr1 &= HAL_LL_UART_IT_CR1_MASK;
    hal_ll_hw_reg->cr2 &= HAL_LL_UART_IT_CR2_MASK;
    hal_ll_hw_reg->cr3 &= HAL_LL_UART_IT_CR3_MASK;
}

static void hal_ll_uart_hw_init( hal_ll_uart_hw_specifics_map_t *map ) {
    hal_ll_uart_clear_regs( map->base );

    hal_ll_uart_set_data_bits_bare_metal( map );

    hal_ll_uart_set_parity_bare_metal( map );

    hal_ll_uart_set_stop_bits_bare_metal( map );

    hal_ll_uart_set_baud_bare_metal( map );

    hal_ll_uart_set_transmitter( map->base, HAL_LL_UART_ENABLE );

    hal_ll_uart_set_receiver( map->base, HAL_LL_UART_ENABLE );

    hal_ll_uart_set_module( map->base, HAL_LL_UART_ENABLE );
}

static void hal_ll_uart_init( hal_ll_uart_hw_specifics_map_t *map ) {
    hal_ll_uart_set_clock( map, true );

    hal_ll_uart_alternate_functions_set_state( map, true );

    hal_ll_uart_hw_init( map );
}
// ------------------------------------------------------------------------- END
